[
  {
    "name": "Harry Potter",
    "species": "human",
    "gender": "male",
    "house": "Gryffindor",
    "dateOfBirth": "31-07-1980",
    "yearOfBirth": 1980,
    "ancestry": "half-blood",
    "description": "The central character in the series is Harry Potter, a boy who lives in the fictional town of Little Whinging, Surrey with his aunt, uncle, and cousin – the Dursleys – and discovers at the age of eleven that he is a wizard, though he lives in the ordinary world of non-magical people known as Muggles.[8] The wizarding world exists parallel to the Muggle world, albeit hidden and in secrecy. His magical ability is inborn, and children with such abilities are invited to attend exclusive magic schools that teach the necessary skills to succeed in the wizarding world.[9]",
    "eyeColour": "green",
    "hairColour": "black",
    "wand": {
      "wood": "holly",
      "core": "phoenix feather",
      "length": 11
    },
    "patronus": "stag",
    "hogwartsStudent": true,
    "hogwartsStaff": false,
    "actor": "Daniel Radcliffe",
    "alive": true,
    "image": "http://hp-api.herokuapp.com/images/harry.jpg"
  },
  {
    "name": "Hermione Granger",
    "species": "human",
    "gender": "female",
    "house": "Gryffindor",
    "dateOfBirth": "19-09-1979",
    "yearOfBirth": 1979,
    "ancestry": "muggleborn",
    "description": "Hermione Jean Granger (/hɜːrˈmaɪ.əni/ /ˈɡreɪndʒər/ hur-MY-ə-nee GRAYN-jər) is a fictional character in J. K. Rowling's Harry Potter series. She first appears in Harry Potter and the Philosopher's Stone, as a new student on her way to Hogwarts. After Harry and Ron save her from a mountain troll in the girls' restroom, she becomes best friends with them and often uses her quick wit, deft recall, and encyclopaedic knowledge to lend aid in dire situations. Rowling has stated that Hermione resembles herself as a young girl, with her insecurity and fear of failure.[2] ",
    "eyeColour": "brown",
    "hairColour": "brown",
    "wand": {
      "wood": "vine",
      "core": "dragon heartstring",
      "length": ""
    },
    "patronus": "otter",
    "hogwartsStudent": true,
    "hogwartsStaff": false,
    "actor": "Emma Watson",
    "alive": true,
    "image": "http://hp-api.herokuapp.com/images/hermione.jpeg"
  },
  {
    "name": "Ron Weasley",
    "species": "human",
    "gender": "male",
    "house": "Gryffindor",
    "dateOfBirth": "01-03-1980",
    "yearOfBirth": 1980,
    "ancestry": "pure-blood",
    "description": "Ronald Bilius Weasley is a fictional character in J. K. Rowling's Harry Potter fantasy novel series. His first appearance was in the first book of the series, Harry Potter and the Philosopher's Stone, as the best friend of Harry Potter and Hermione Granger. He is a member of the Weasley family, a pure blood family that resides in \"The Burrow\" outside Ottery St. Catchpole. Being the only member of the three main characters raised in magical society, he also provides insight into the Wizarding World's magical customs and traditions. Along with Harry and Hermione, he is a member of Gryffindor house and is present for most of the action throughout the series.",
    "eyeColour": "blue",
    "hairColour": "red",
    "wand": {
      "wood": "willow",
      "core": "unicorn tail-hair",
      "length": 14
    },
    "patronus": "Jack Russell terrier",
    "hogwartsStudent": true,
    "hogwartsStaff": false,
    "actor": "Rupert Grint",
    "alive": true,
    "image": "http://hp-api.herokuapp.com/images/ron.jpg"
  },
  {
    "name": "Draco Malfoy",
    "species": "human",
    "gender": "male",
    "house": "Slytherin",
    "dateOfBirth": "05-06-1980",
    "yearOfBirth": 1980,
    "ancestry": "pure-blood",
    "description": "Draco Lucius Malfoy is a fictional character in J. K. Rowling's Harry Potter series. He is a student in Harry Potter's year belonging in the Slytherin house. He is frequently accompanied by his two cronies, Vincent Crabbe and Gregory Goyle, who act as henchmen. Draco is characterised as a cowardly bully who tricks and hurts people to get what he wants; nevertheless, he is a cunning user of magic.",
    "eyeColour": "grey",
    "hairColour": "blonde",
    "wand": {
      "wood": "hawthorn",
      "core": "unicorn tail-hair",
      "length": 10
    },
    "patronus": "",
    "hogwartsStudent": true,
    "hogwartsStaff": false,
    "actor": "Tom Felton",
    "alive": true,
    "image": "http://hp-api.herokuapp.com/images/draco.jpg"
  },
  {
    "name": "Minerva McGonagall",
    "species": "human",
    "gender": "female",
    "house": "Gryffindor",
    "dateOfBirth": "04-10-1925",
    "yearOfBirth": 1925,
    "ancestry": "",
    "description":"Professor Minerva McGonagall is a fictional character in J. K. Rowling's Harry Potter series. Professor McGonagall is a professor at Hogwarts School for Witchcraft and Wizardry and is the head of Gryffindor House and professor of Transfiguration, as well as being the Deputy Headmistress under Albus Dumbledore and a member of the Order of the Phoenix. Following Lord Voldemort's defeat at the hands of her student Harry Potter and the deaths of Headmasters Albus Dumbledore and Severus Snape, McGonagall takes the position of Headmistress. ",
    "eyeColour": "",
    "hairColour": "black",
    "wand": {
      "wood": "",
      "core": "",
      "length": ""
    },
    "patronus": "tabby cat",
    "hogwartsStudent": false,
    "hogwartsStaff": true,
    "actor": "Dame Maggie Smith",
    "alive": true,
    "image": "http://hp-api.herokuapp.com/images/mcgonagall.jpg"
  },
  {
    "name": "Cedric Diggory",
    "species": "human",
    "gender": "male",
    "house": "Hufflepuff",
    "dateOfBirth": "",
    "yearOfBirth": 1977,
    "ancestry": "",
    "description": "Cedric Diggory is a fictional character in J. K. Rowling's Harry Potter series. Cedric is one of the main characters in the fourth book, Harry Potter and the Goblet of Fire, as he represents Hogwarts School of Witchcraft and Wizardry in the Triwizard Tournament, alongside Harry Potter. Cedric is murdered by Peter Pettigrew on Lord Voldemort's orders during Voldemort's resurrection in Little Hangleton.[1]\n\nCedric's death becomes a point of trauma and guilt for Harry and continues to haunt him, which leads him to form Dumbledore's Army as a way to help teach his fellow students to protect themselves in battle. Cedric's death is also a focal point of the stage play Harry Potter and the Cursed Child. Cedric was portrayed by Robert Pattinson in the film adaptation of Goblet of Fire and was briefly portrayed by Joe Livermore in Prisoner of Azkaban.[2] ",
    "eyeColour": "grey",
    "hairColour": "brown",
    "wand": {
      "wood": "ash",
      "core": "unicorn hair",
      "length": 12.25
    },
    "patronus": "",
    "hogwartsStudent": true,
    "hogwartsStaff": false,
    "actor": "Robert Pattinson",
    "alive": false,
    "image": "http://hp-api.herokuapp.com/images/cedric.png"
  },
  {
    "name": "Cho Chang",
    "species": "human",
    "gender": "female",
    "house": "Ravenclaw",
    "dateOfBirth": "",
    "yearOfBirth": "",
    "ancestry": "",
    "description": "Cho Chang is a Ravenclaw student one year above Harry, and is the Seeker for the Ravenclaw Quidditch team. She is best known for being Harry's first love interest, is described as being \"very pretty\" with long dark hair and is frequently accompanied by a group of giggling girls. In Goblet of Fire, Harry's crush on Cho intensifies and he works up the courage to ask her out to the Yule Ball, one of the necessary events in the Triwizard Tournament, but Cho apologises and replies that she had previously accepted Cedric Diggory's offer. Nonetheless, Cho is still kind to Harry, much to his relief, and she refuses to wear one of Draco Malfoy's \"Potter Stinks\" badges.",
    "eyeColour": "brown",
    "hairColour": "black",
    "wand": {
      "wood": "",
      "core": "",
      "length": ""
    },
    "patronus": "swan",
    "hogwartsStudent": true,
    "hogwartsStaff": false,
    "actor": "Katie Leung",
    "alive": true,
    "image": "http://hp-api.herokuapp.com/images/cho.jpg"
  },
  {
    "name": "Severus Snape",
    "species": "human",
    "gender": "male",
    "house": "Slytherin",
    "dateOfBirth": "09-01-1960",
    "yearOfBirth": 1960,
    "ancestry": "half-blood",
    "description": "Severus Snape is a fictional character in J. K. Rowling's Harry Potter series. He is an exceptionally skilled wizard whose sarcastic, controlled exterior conceals deep emotions and anguish. A Professor at Hogwarts School of Witchcraft and Wizardry, Snape is hostile to Harry due to his resemblance to his father James Potter. According to the series, James bullied Snape during their time together at Hogwarts. ",
    "eyeColour": "black",
    "hairColour": "black",
    "wand": {
      "wood": "",
      "core": "",
      "length": ""
    },
    "patronus": "doe",
    "hogwartsStudent": false,
    "hogwartsStaff": true,
    "actor": "Alan Rickman",
    "alive": false,
    "image": "http://hp-api.herokuapp.com/images/snape.jpg"
  },
  {
    "name": "Rubeus Hagrid",
    "species": "half-giant",
    "gender": "male",
    "house": "Gryffindor",
    "dateOfBirth": "06-12-1928",
    "yearOfBirth": 1928,
    "ancestry": "half-blood",
    "description":"Rubeus Hagrid is a fictional character in the Harry Potter book series written by J. K. Rowling. He is introduced in Harry Potter and the Philosopher's Stone as a half-giant and half-human who is the gamekeeper and Keeper of Keys and Grounds of Hogwarts, the primary setting for the first six novels. In the third novel Harry Potter and the Prisoner of Azkaban, Hagrid is promoted to Care of Magical Creatures professor, and is later revealed to be a member of the Order of the Phoenix. A loyal, friendly, softhearted personality who is easily brought to tears, he is also known for his thick West Country accent. ",
    "eyeColour": "black",
    "hairColour": "black",
    "wand": {
      "wood": "oak",
      "core": "",
      "length": 16
    },
    "patronus": "",
    "hogwartsStudent": false,
    "hogwartsStaff": true,
    "actor": "Robbie Coltrane",
    "alive": true,
    "image": "http://hp-api.herokuapp.com/images/hagrid.png"
  },
  {
    "name": "Neville Longbottom",
    "species": "human",
    "gender": "male",
    "house": "Gryffindor",
    "dateOfBirth": "30-07-1980",
    "yearOfBirth": 1980,
    "ancestry": "pure-blood",
    "description":"Neville Longbottom is a fictional character in J. K. Rowling's Harry Potter book series. He is described as a round-faced Gryffindor student in the central character Harry Potter's year. Throughout the series, Neville is often portrayed as a bumbling and disorganised character, and a rather mediocre student, though he is highly gifted at Herbology.",
    "eyeColour": "",
    "hairColour": "blonde",
    "wand": {
      "wood": "cherry",
      "core": "unicorn tail-hair",
      "length": 13
    },
    "patronus": "",
    "hogwartsStudent": true,
    "hogwartsStaff": false,
    "actor": "Matthew Lewis",
    "alive": true,
    "image": "http://hp-api.herokuapp.com/images/neville.jpg"
  },
  {
    "name": "Luna Lovegood",
    "species": "human",
    "gender": "female",
    "house": "Ravenclaw",
    "dateOfBirth": "13-02-1981",
    "yearOfBirth": 1981,
    "ancestry": "",
    "description":"Luna Lovegood is a fictional character in the Harry Potter book series written by J. K. Rowling. The character first appears in Harry Potter and the Order of the Phoenix, in which she is described as having straggly, waist-length dirty-blond hair and a dazed look on her face. Her eyes are \"silvery\", \"misty\", and \"protuberant\" (the last quality serving to give her a \"permanently surprised look\").",
    "eyeColour": "grey",
    "hairColour": "blonde",
    "wand": {
      "wood": "",
      "core": "",
      "length": ""
    },
    "patronus": "hare",
    "hogwartsStudent": true,
    "hogwartsStaff": false,
    "actor": "Evanna Lynch",
    "alive": true,
    "image": "http://hp-api.herokuapp.com/images/luna.jpg"
  },
  {
    "name": "Ginny Weasley",
    "species": "human",
    "gender": "female",
    "house": "Gryffindor",
    "dateOfBirth": "11-08-1981",
    "yearOfBirth": 1981,
    "ancestry": "pure-blood",
    "description":"Ginevra Molly Weasley is a fictional character in J. K. Rowling's Harry Potter novel series. Ginny is introduced in the first book Harry Potter and the Philosopher's Stone, as the youngest sibling and only girl in the Weasley family. She becomes Harry's main love interest and eventually marries him at the conclusion of the series. ",
    "eyeColour": "brown",
    "hairColour": "red",
    "wand": {
      "wood": "yew",
      "core": "",
      "length": ""
    },
    "patronus": "horse",
    "hogwartsStudent": true,
    "hogwartsStaff": false,
    "actor": "Bonnie Wright",
    "alive": true,
    "image": "http://hp-api.herokuapp.com/images/ginny.jpg"
  },
  {
    "name": "Sirius Black",
    "species": "human",
    "gender": "male",
    "house": "Gryffindor",
    "dateOfBirth": "03-11-1959",
    "yearOfBirth": 1959,
    "ancestry": "pure-blood",
    "description": "Sirius Black is a character in J. K. Rowling's Harry Potter series. Sirius was first mentioned briefly in Harry Potter and the Philosopher's Stone as a wizard who lent Rubeus Hagrid a flying motorbike shortly after Lord Voldemort killed James and Lily Potter. His character becomes prominent in Harry Potter and the Prisoner of Azkaban, in which he is the titular prisoner, and is also revealed to be the godfather of the central character Harry Potter.",
    "eyeColour": "grey",
    "hairColour": "black",
    "wand": {
      "wood": "",
      "core": "",
      "length": ""
    },
    "patronus": "hare",
    "hogwartsStudent": false,
    "hogwartsStaff": false,
    "actor": "Gary Oldman",
    "alive": false,
    "image": "http://hp-api.herokuapp.com/images/sirius.JPG"
  },
  {
    "name": "Remus Lupin",
    "species": "werewolf",
    "gender": "male",
    "house": "Gryffindor",
    "dateOfBirth": "10-03-1960",
    "yearOfBirth": 1960,
    "ancestry": "half-blood",
    "description": "Remus John Lupin is a fictional character in the Harry Potter book series written by J. K. Rowling. He first appears in Harry Potter and the Prisoner of Azkaban as the new Defence Against the Dark Arts professor. Lupin remains in the story long after resigning from this post as a friend to the central character, Harry Potter. In the films, he is portrayed by David Thewlis as an adult, and James Utechin as a teenager.",
    "eyeColour": "green",
    "hairColour": "brown",
    "wand": {
      "wood": "cypress",
      "core": "unicorn tail-hair",
      "length": 10.25
    },
    "patronus": "wolf",
    "hogwartsStudent": false,
    "hogwartsStaff": true,
    "actor": "David Thewlis",
    "alive": false,
    "image": "http://hp-api.herokuapp.com/images/lupin.jpg"
  },
  {
    "name": "Arthur Weasley",
    "species": "human",
    "gender": "male",
    "house": "Gryffindor",
    "dateOfBirth": "06-02-1950",
    "yearOfBirth": 1950,
    "ancestry": "pure-blood",
    "description":"Arthur Weasley is the patriarch of the Weasleys, a family of wizards who are considered \"blood traitors\" by Death Eaters for their interest in the Muggle world. He is married to Molly Weasley, with whom he has seven children, including Ron, Harry's best friend. During his time at Hogwarts, Arthur belonged to the house of Gryffindor. Arthur is described as being tall and thin, and as having a receding hairline and horn-rimmed glasses.",
    "eyeColour": "blue",
    "hairColour": "red",
    "wand": {
      "wood": "",
      "core": "",
      "length": ""
    },
    "patronus": "weasel",
    "hogwartsStudent": false,
    "hogwartsStaff": false,
    "actor": "Mark Williams",
    "alive": true,
    "image": "http://hp-api.herokuapp.com/images/arthur.jpg"
  },
  {
    "name": "Bellatrix Lestrange",
    "species": "human",
    "gender": "female",
    "house": "Slytherin",
    "dateOfBirth": "",
    "yearOfBirth": 1951,
    "ancestry": "pure-blood",
    "description":"Bellatrix Lestrange (née Black) is a fictional character in the Harry Potter book series written by J. K. Rowling. She evolved from an unnamed periphery character in Harry Potter and the Goblet of Fire into a major antagonist in subsequent novels. In the final instalment of the story, Rowling established her as Lord Voldemort's \"last, best lieutenant\". Bellatrix was the first female Death Eater introduced in the books, and remained the only woman explicitly identified as such until Harry Potter and the Half-Blood Prince.",
    "eyeColour": "brown",
    "hairColour": "black",
    "wand": {
      "wood": "walnut",
      "core": "dragon heartstring",
      "length": 12.75
    },
    "patronus": "",
    "hogwartsStudent": false,
    "hogwartsStaff": false,
    "actor": "Helena Bonham Carter",
    "alive": false,
    "image": "http://hp-api.herokuapp.com/images/bellatrix.jpg"
  },
  {
    "name": "Lord Voldemort",
    "species": "human",
    "gender": "male",
    "house": "Slytherin",
    "dateOfBirth": "31-12-1926",
    "yearOfBirth": 1926,
    "ancestry": "half-blood",
    "description":"Voldemort is the archenemy of Harry Potter, who according to a prophecy has \"the power to vanquish the Dark Lord\". He attempts to murder the boy, but instead kills his parents, Lily and James Potter, and leaves Harry with a scar on his head in the shape of a lightning bolt. Nearly every witch or wizard dares not utter his name and refers to him instead with such monikers as \"You-Know-Who\", \"He Who Must Not Be Named\", or \"the Dark Lord\". Voldemort's obsession with blood purity signifies his aim to rid the wizarding world of Muggle (non-magical) heritage and to conquer both worlds, Muggle and wizarding, to achieve pure-blood dominance. Through his mother's family, he is the last descendant of the wizard Salazar Slytherin,[6][7] one of the four founders of Hogwarts School of Witchcraft and Wizardry. He is the leader of the Death Eaters, a group of evil wizards and witches dedicated to ridding the Wizarding World of Muggles and establishing Voldemort as its supreme ruler.",
    "eyeColour": "red",
    "hairColour": "bald",
    "wand": {
      "wood": "yew",
      "core": "phoenix feather",
      "length": 13.5
    },
    "patronus": "",
    "hogwartsStudent": false,
    "hogwartsStaff": false,
    "actor": "Ralph Fiennes",
    "alive": false,
    "image": "http://hp-api.herokuapp.com/images/voldemort.jpg"
  },
  {
    "name": "Horace Slughorn",
    "species": "human",
    "gender": "male",
    "house": "Slytherin",
    "dateOfBirth": "",
    "yearOfBirth": "",
    "ancestry": "pure-blood",
    "description": "Horace Slughorn is the long-serving Potions teacher and Head of Slytherin House since at least the 1940s, until his retirement after the 1981–82 school year. Following his retirement and the resurgence of Voldemort, Slughorn goes into hiding, concealing all knowledge of his whereabouts from both sides in the growing conflict in the wizarding world.",
    "eyeColour": "green",
    "hairColour": "blonde",
    "wand": {
      "wood": "cedar",
      "core": "dragon heartstring",
      "length": 10.25
    },
    "patronus": "",
    "hogwartsStudent": false,
    "hogwartsStaff": true,
    "actor": "Jim Broadbent",
    "alive": true,
    "image": "http://hp-api.herokuapp.com/images/slughorn.JPG"
  },
  {
    "name": "Kingsley Shacklebolt",
    "species": "human",
    "gender": "male",
    "house": "",
    "dateOfBirth": "",
    "yearOfBirth": "",
    "ancestry": "pure-blood",
    "description": "Kingsley Shacklebolt is a senior Auror who acts as informer for the Order within the Ministry of Magic. He is first introduced in Harry Potter and the Order of the Phoenix, when he volunteers to be one of the members of the Advance Guard that escorted Harry from the Dursleys' home to Number 12, Grimmauld Place. Kingsley is in charge of the search for Sirius in the Ministry; however, knowing Sirius is innocent, he is supplying the Ministry false information that Sirius is in Tibet.",
    "eyeColour": "brown",
    "hairColour": "brown",
    "wand": {
      "wood": "",
      "core": "",
      "length": ""
    },
    "patronus": "lynx",
    "hogwartsStudent": false,
    "hogwartsStaff": false,
    "actor": "George Harris",
    "alive": true,
    "image": "http://hp-api.herokuapp.com/images/kingsley.jpg"
  },
  {
    "name": "Dolores Umbridge",
    "species": "human",
    "gender": "female",
    "house": "Slytherin",
    "dateOfBirth": "",
    "yearOfBirth": "",
    "ancestry": "half-blood",
    "description": "Dolores Jane Umbridge is a fictional character from the Harry Potter series created by J.K. Rowling. The character is the primary antagonist of the fifth novel Harry Potter and the Order of the Phoenix and was stationed at Hogwarts by the Ministry of Magic to take power away from Harry Potter and Albus Dumbledore, who were informing the Wizarding World of Lord Voldemort's return. While at Hogwarts, Umbridge grows in power and is appointed \"High Inquisitor\" by the Minister of Magic in an attempt to control the school.",
    "eyeColour": "brown",
    "hairColour": "grey",
    "wand": {
      "wood": "birch",
      "core": "dragon heartstring",
      "length": 8
    },
    "patronus": "persian cat",
    "hogwartsStudent": false,
    "hogwartsStaff": true,
    "actor": "Imelda Staunton",
    "alive": true,
    "image": "http://hp-api.herokuapp.com/images/umbridge.jpg"
  },
  {
    "name": "Lucius Malfoy",
    "species": "human",
    "gender": "male",
    "house": "Slytherin",
    "dateOfBirth": "",
    "yearOfBirth": 1954,
    "ancestry": "pure-blood",
    "description": "Lucius Malfoy is a Death Eater, head of a wealthy pure-blood wizarding family and a psychopath; he lives with his wife Narcissa Malfoy (née Black) and their son Draco at the Malfoy Manor in Wiltshire. Lucius was a school governor of Hogwarts before being sacked, and has very close connections at the Ministry of Magic. To maintain his reputation and influence, he makes donations to the Ministry, to charity, and to St Mungo's Hospital. He was educated at Hogwarts, where he was a prefect in Slytherin House.",
    "eyeColour": "grey",
    "hairColour": "blonde",
    "wand": {
      "wood": "elm",
      "core": "dragon heartstring",
      "length": 18
    },
    "patronus": "",
    "hogwartsStudent": false,
    "hogwartsStaff": false,
    "actor": "Jason Isaacs",
    "alive": true,
    "image": "http://hp-api.herokuapp.com/images/lucius.jpg"
  },
  {
    "name": "Vincent Crabbe",
    "species": "human",
    "gender": "male",
    "house": "Slytherin",
    "dateOfBirth": "",
    "yearOfBirth": "",
    "ancestry": "pure-blood",
    "description": "Vincent Crabbe and Gregory Goyle are Slytherin students in Harry's year; both of their fathers, Crabbe Sr and Goyle Sr, are Death Eaters. Due to their size and strength, the pair act as Draco Malfoy's minions and serve \"to do Malfoy's bidding\", especially to intimidate fellow students. Both are entirely lacking in introspection or curiosity, though Crabbe is shown to be significantly smarter than Goyle. They seem unable to make up their own minds or to see things their own way.",
    "eyeColour": "black",
    "hairColour": "black",
    "wand": {
      "wood": "",
      "core": "",
      "length": ""
    },
    "patronus": "",
    "hogwartsStudent": true,
    "hogwartsStaff": false,
    "actor": "Jamie Waylett",
    "alive": false,
    "image": "http://hp-api.herokuapp.com/images/crabbe.jpg"
  },
  {
    "name": "Gregory Goyle",
    "species": "human",
    "gender": "male",
    "house": "Slytherin",
    "dateOfBirth": "",
    "yearOfBirth": "",
    "ancestry": "pure-blood",
    "description": "Vincent Crabbe and Gregory Goyle are Slytherin students in Harry's year; both of their fathers, Crabbe Sr and Goyle Sr, are Death Eaters. Due to their size and strength, the pair act as Draco Malfoy's minions and serve \"to do Malfoy's bidding\", especially to intimidate fellow students. Both are entirely lacking in introspection or curiosity, though Crabbe is shown to be significantly smarter than Goyle.",
    "eyeColour": "",
    "hairColour": "brown",
    "wand": {
      "wood": "",
      "core": "",
      "length": ""
    },
    "patronus": "",
    "hogwartsStudent": true,
    "hogwartsStaff": false,
    "actor": "Josh Herdman",
    "alive": true,
    "image": "http://hp-api.herokuapp.com/images/goyle.jpg"
  },
  {
    "name": "Mrs Norris",
    "species": "cat",
    "gender": "female",
    "house": "",
    "dateOfBirth": "",
    "yearOfBirth": "",
    "ancestry": "",
    "description": "",
    "eyeColour": "yellow",
    "hairColour": "brown",
    "wand": {
      "wood": "",
      "core": "",
      "length": ""
    },
    "patronus": "",
    "hogwartsStudent": false,
    "hogwartsStaff": true,
    "actor": "Maxime, Alanis and Tommy the cats",
    "alive": true,
    "image": "http://hp-api.herokuapp.com/images/norris.JPG"
  },
  {
    "name": "Argus Filch",
    "species": "human",
    "gender": "male",
    "house": "",
    "dateOfBirth": "",
    "yearOfBirth": "",
    "ancestry": "squib",
    "description": "",
    "biography": "",
    "eyeColour": "",
    "hairColour": "grey",
    "wand": {
      "wood": "",
      "core": "",
      "length": ""
    },
    "patronus": "",
    "hogwartsStudent": false,
    "hogwartsStaff": true,
    "actor": "David Bradley",
    "alive": true,
    "image": "http://hp-api.herokuapp.com/images/filch.jpg"
  }
]